import unittest
from main import compress_numbers

class TestCompressNumbers(unittest.TestCase):
    #   Пустой список
    #	Проверяет граничное условие: функция должна корректно обработать отсутствие данных и вернуть пустой список,
    #	не вызвав ошибку индексации
    def test_empty_list(self):
        self.assertEqual(compress_numbers([]), [])

    #   Список из одного элемента
    #   Проверяет минимально возможный непустой вход.
    #   Алгоритм не должен пытаться обратиться к несуществующему предыдущему элементу.
    def test_single_element(self):
        self.assertEqual(compress_numbers([42]), [42])

    #   Список без дубликатов
    #   Проверяет, что функция не удаляет уникальные элементы и возвращает результат, идентичный входным данным.
    def test_no_duplicates(self):
        self.assertEqual(compress_numbers([1, 2, 3, 4, 5]), [1, 2, 3, 4, 5])

    #   Список, где дубликаты идут только подряд
    #   Проверяет основную логику работы: удаление именно последовательных повторов с сохранением первого вхождения каждого числа.
    def test_consecutive_duplicates(self):
        self.assertEqual(compress_numbers([1, 1, 2, 2, 2, 3, 3, 1, 1]), [1, 2, 3, 1])

    #   Список, где одинаковые значения разделены другими числами
    #   Проверяет, что алгоритм учитывает только соседние элементы.
    #   Одинаковые числа, между которыми есть другие значения, должны остаться в списке.
    def test_non_consecutive_duplicates(self):
        self.assertEqual(compress_numbers([1, 2, 1, 2, 1]), [1, 2, 1, 2, 1])

    #   Списки с отрицательными числами, нулями и числами с плавающей точкой
    #   Проверяет работу с целыми отрицательными числами и нулем.
    def test_negative_and_zero(self):
        self.assertEqual(compress_numbers([0, 0, -1, -1, -1, 0, 5, 5]), [0, -1, 0, 5])

    #   Списки с числами с плавающей точкой
    #   Проверяет, что функция работает с типом float так же корректно, как и с int.
    def test_floats(self):
        self.assertEqual(compress_numbers([1.1, 1.1, 2.5, 2.5, 2.5, 3.0]), [1.1, 2.5, 3.0])

    #   Список, состоящий из одного повторяющегося значения
    #   Проверяет крайний случай, когда весь массив состоит из дублей.
    #   Результатом должен быть список из одного элемента.
    def test_all_same(self):
        self.assertEqual(compress_numbers([7, 7, 7, 7, 7]), [7])

    #   Проверка того, что исходный список не изменяется
    #   Проверяет отсутствие побочных эффектов.
    #   Так как функция создает и возвращает новый список, входной список original должен остаться нетронутым.
    def test_original_list_unchanged(self):
        original = [1, 1, 2, 2]
        _ = compress_numbers(original)
        self.assertEqual(original, [1, 1, 2, 2])

if __name__ == '__main__':
    unittest.main(argv=[''], exit=False)